aws-samples/aws-stm32-ml-at-edge-accelerator/stm32/Drivers/BSP/Components/lsm6dso/lsm6dso_reg.h
typedef enum {
  LSM6DSO_EVERY_STEP     = 0,
  LSM6DSO_COUNT_OVERFLOW = 1,
} lsm6dso_carry_count_en_t;
int32_t lsm6dso_pedo_int_mode_set(stmdev_ctx_t *ctx,
                                  lsm6dso_carry_count_en_t val);
int32_t lsm6dso_pedo_int_mode_get(stmdev_ctx_t *ctx,
                                  lsm6dso_carry_count_en_t *val);

int32_t lsm6dso_motion_flag_data_ready_get(stmdev_ctx_t *ctx,
                                           uint8_t *val);

int32_t lsm6dso_tilt_flag_data_ready_get(stmdev_ctx_t *ctx,
                                         uint8_t *val);

int32_t lsm6dso_mag_sensitivity_set(stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dso_mag_sensitivity_get(stmdev_ctx_t *ctx, uint16_t *val);

int32_t lsm6dso_mag_offset_set(stmdev_ctx_t *ctx, int16_t *val);
int32_t lsm6dso_mag_offset_get(stmdev_ctx_t *ctx, int16_t *val);

int32_t lsm6dso_mag_soft_iron_set(stmdev_ctx_t *ctx, int16_t *val);
int32_t lsm6dso_mag_soft_iron_get(stmdev_ctx_t *ctx, int16_t *val);

typedef enum {
  LSM6DSO_Z_EQ_Y     = 0,
  LSM6DSO_Z_EQ_MIN_Y = 1,
  LSM6DSO_Z_EQ_X     = 2,
  LSM6DSO_Z_EQ_MIN_X = 3,
  LSM6DSO_Z_EQ_MIN_Z = 4,
  LSM6DSO_Z_EQ_Z     = 5,
} lsm6dso_mag_z_axis_t;
int32_t lsm6dso_mag_z_orient_set(stmdev_ctx_t *ctx,
                                 lsm6dso_mag_z_axis_t val);
int32_t lsm6dso_mag_z_orient_get(stmdev_ctx_t *ctx,
                                 lsm6dso_mag_z_axis_t *val);

typedef enum {
  LSM6DSO_Y_EQ_Y     = 0,
  LSM6DSO_Y_EQ_MIN_Y = 1,
  LSM6DSO_Y_EQ_X     = 2,
  LSM6DSO_Y_EQ_MIN_X = 3,
  LSM6DSO_Y_EQ_MIN_Z = 4,
  LSM6DSO_Y_EQ_Z     = 5,
} lsm6dso_mag_y_axis_t;
int32_t lsm6dso_mag_y_orient_set(stmdev_ctx_t *ctx,
                                 lsm6dso_mag_y_axis_t val);
int32_t lsm6dso_mag_y_orient_get(stmdev_ctx_t *ctx,
                                 lsm6dso_mag_y_axis_t *val);

typedef enum {
  LSM6DSO_X_EQ_Y     = 0,
  LSM6DSO_X_EQ_MIN_Y = 1,
  LSM6DSO_X_EQ_X     = 2,
  LSM6DSO_X_EQ_MIN_X = 3,
  LSM6DSO_X_EQ_MIN_Z = 4,
  LSM6DSO_X_EQ_Z     = 5,
} lsm6dso_mag_x_axis_t;
int32_t lsm6dso_mag_x_orient_set(stmdev_ctx_t *ctx,
                                 lsm6dso_mag_x_axis_t val);
int32_t lsm6dso_mag_x_orient_get(stmdev_ctx_t *ctx,
                                 lsm6dso_mag_x_axis_t *val);

int32_t lsm6dso_long_cnt_flag_data_ready_get(stmdev_ctx_t *ctx,
                                             uint8_t *val);

typedef struct {
  lsm6dso_fsm_enable_a_t          fsm_enable_a;
  lsm6dso_fsm_enable_b_t          fsm_enable_b;
} lsm6dso_emb_fsm_enable_t;
int32_t lsm6dso_fsm_enable_set(stmdev_ctx_t *ctx,
                               lsm6dso_emb_fsm_enable_t *val);
int32_t lsm6dso_fsm_enable_get(stmdev_ctx_t *ctx,
                               lsm6dso_emb_fsm_enable_t *val);

int32_t lsm6dso_long_cnt_set(stmdev_ctx_t *ctx, uint16_t val);
int32_t lsm6dso_long_cnt_get(stmdev_ctx_t *ctx, uint16_t *val);

typedef enum {
  LSM6DSO_LC_NORMAL     = 0,
  LSM6DSO_LC_CLEAR      = 1,
  LSM6DSO_LC_CLEAR_DONE = 2,
} lsm6dso_fsm_lc_clr_t;
int32_t lsm6dso_long_clr_set(stmdev_ctx_t *ctx,
                             lsm6dso_fsm_lc_clr_t val);
int32_t lsm6dso_long_clr_get(stmdev_ctx_t *ctx,
                             lsm6dso_fsm_lc_clr_t *val);

typedef struct {
  lsm6dso_fsm_outs1_t    fsm_outs1;
  lsm6dso_fsm_outs2_t    fsm_outs2;
  lsm6dso_fsm_outs3_t    fsm_outs3;
  lsm6dso_fsm_outs4_t    fsm_outs4;
  lsm6dso_fsm_outs5_t    fsm_outs5;
  lsm6dso_fsm_outs6_t    fsm_outs6;
  lsm6dso_fsm_outs7_t    fsm_outs7;
  lsm6dso_fsm_outs8_t    fsm_outs8;
  lsm6dso_fsm_outs9_t    fsm_outs9;
  lsm6dso_fsm_outs10_t   fsm_outs10;
  lsm6dso_fsm_outs11_t   fsm_outs11;
  lsm6dso_fsm_outs12_t   fsm_outs12;
  lsm6dso_fsm_outs13_t   fsm_outs13;
  lsm6dso_fsm_outs14_t   fsm_outs14;
  lsm6dso_fsm_outs15_t   fsm_outs15;
  lsm6dso_fsm_outs16_t   fsm_outs16;
} lsm6dso_fsm_out_t;
int32_t lsm6dso_fsm_out_get(stmdev_ctx_t *ctx,
                            lsm6dso_fsm_out_t *val);

typedef enum {
  LSM6DSO_ODR_FSM_12Hz5 = 0,
  LSM6DSO_ODR_FSM_26Hz  = 1,
  LSM6DSO_ODR_FSM_52Hz  = 2,
  LSM6DSO_ODR_FSM_104Hz = 3,
} lsm6dso_fsm_odr_t;
int32_t lsm6dso_fsm_data_rate_set(stmdev_ctx_t *ctx,
                                  lsm6dso_fsm_odr_t val);
int32_t lsm6dso_fsm_data_rate_get(stmdev_ctx_t *ctx,
                                  lsm6dso_fsm_odr_t *val);

int32_t lsm6dso_fsm_init_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_fsm_init_get(stmdev_ctx_t *ctx, uint8_t *val);

int32_t lsm6dso_long_cnt_int_value_set(stmdev_ctx_t *ctx,
                                       uint16_t val);
int32_t lsm6dso_long_cnt_int_value_get(stmdev_ctx_t *ctx,
                                       uint16_t *val);

int32_t lsm6dso_fsm_number_of_programs_set(stmdev_ctx_t *ctx,
                                           uint8_t val);
int32_t lsm6dso_fsm_number_of_programs_get(stmdev_ctx_t *ctx,
                                           uint8_t *val);

int32_t lsm6dso_fsm_start_address_set(stmdev_ctx_t *ctx,
                                      uint16_t val);
int32_t lsm6dso_fsm_start_address_get(stmdev_ctx_t *ctx,
                                      uint16_t *val);

int32_t lsm6dso_sh_read_data_raw_get(stmdev_ctx_t *ctx, uint8_t *val,
                                     uint8_t len);

typedef enum {
  LSM6DSO_SLV_0       = 0,
  LSM6DSO_SLV_0_1     = 1,
  LSM6DSO_SLV_0_1_2   = 2,
  LSM6DSO_SLV_0_1_2_3 = 3,
} lsm6dso_aux_sens_on_t;
int32_t lsm6dso_sh_slave_connected_set(stmdev_ctx_t *ctx,
                                       lsm6dso_aux_sens_on_t val);
int32_t lsm6dso_sh_slave_connected_get(stmdev_ctx_t *ctx,
                                       lsm6dso_aux_sens_on_t *val);

int32_t lsm6dso_sh_master_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_sh_master_get(stmdev_ctx_t *ctx, uint8_t *val);

typedef enum {
  LSM6DSO_EXT_PULL_UP      = 0,
  LSM6DSO_INTERNAL_PULL_UP = 1,
} lsm6dso_shub_pu_en_t;
int32_t lsm6dso_sh_pin_mode_set(stmdev_ctx_t *ctx,
                                lsm6dso_shub_pu_en_t val);
int32_t lsm6dso_sh_pin_mode_get(stmdev_ctx_t *ctx,
                                lsm6dso_shub_pu_en_t *val);

int32_t lsm6dso_sh_pass_through_set(stmdev_ctx_t *ctx, uint8_t val);
int32_t lsm6dso_sh_pass_through_get(stmdev_ctx_t *ctx, uint8_t *val);

